package edu.lemon;

import org.w3c.dom.ls.LSOutput;

import java.util.Arrays;
import java.util.Scanner;

public class Main {

    static String cities = null;
    static String[] listCity;
    static int index;
    static String liter;

    public static void main(String[] args) {

        info();
        while (true){

            liter = lastLiter(userWord());
            index = randomStr(sortByLastLetter(arrCitiesFilter(strCity()), liter));
            System.out.println(sortByLastLetter(arrCitiesFilter(strCity()), liter)[index]);
        }
    }
// Возможность печатать Играку на консоле
    public static String userWord() {
        Scanner sc = new Scanner(System.in);
        return sc.next().trim().toLowerCase();
    }
// Вступление
    public static void info() {
        System.out.println("Привет, давай поиграем в игру Города Украины");
        System.out.println("Каждый раз называем новый город на последнию букву, последнего города ");
        System.out.println("Повторять города нельзя ");
        System.out.println();
        System.out.println("Начинаем. Ты первый, называй город ");
    }
// Последняя буква , из написаного города Игроком на консоле
    public static String lastLiter(String str) {
        String s = String.valueOf(str.charAt(str.length() - 1));
        return s.toUpperCase();
    }
// Случайная цифра для индекса масива
    public static int randomStr(String[] str) {
        return (int) (Math.random() * str.length);
    }
// Создания списка городов по последней букве
    public static String[] sortByLastLetter(String str, String lastChar) {
        String[] arrCity = str.split(" ");
        String city = null;
        for (String s : arrCity) {
            if (s.contains(lastChar)) {

                if (city == null) {
                    city = s + " ";
                } else {
                    city += s + " ";
                }
            }
        }
        return city.split(" ");
    }
// Фильтрация списка городов Украины , чтоб можно было с ними работать
    public static String arrCitiesFilter(String s) {
        String cities;
        String[] regionCity = s.split("\n");
        String gameCities = null;
        for (String str : regionCity) {
            if (str.contains("(")) {
                continue;
            }
            if (gameCities == null) {
                gameCities = str + " ";
            }
            gameCities += str + " ";
        }
        assert gameCities != null;
        cities = Arrays.toString(gameCities.split(" "));

        return cities;
    }

// Копированый список городов Украины из интернета
    public static String strCity() {
        return cities = "Авангард\n" +
                "Александрия (Ровненская обл)\n" +
                "Алчевск\n" +
                "Антоновка\n" +
                "Авдеевка\n" +
                "Александровка (Донецкая обл)\n" +
                "Ананьев\n" +
                "Апостолово\n" +
                "Авиаторское\n" +
                "Александровка (Кировоградская обл)\n" +
                "Андреевка (Запорожская обл)\n" +
                "Арбузинка\n" +
                "Агрономичное (Винницкая обл)\n" +
                "Александровка (Николаевская обл)\n" +
                "Андреевка (Харьковская обл)\n" +
                "Арциз\n" +
                "Аджамка\n" +
                "Алексеево-Дружковка\n" +
                "Андрушевка\n" +
                "Аскания-Нова\n" +
                "Акимовка\n" +
                "Алешки (Цюрупинск)\n" +
                "Антонины\n" +
                "Ахтырка\n" +
                "Александрия (Кировоградская обл)\n" +
                "Алушта\n" +
                "Б\n" +
                "Бабаи\n" +
                "Беловодск\n" +
                "Благовещенское (Ульяновка)\n" +
                "Борщев\n" +
                "Бабанка\n" +
                "Белогородка\n" +
                "Благодатное (Волынская обл)\n" +
                "Бохоники\n" +
                "Балабино\n" +
                "Белогорье\n" +
                "Близнюки\n" +
                "Бояны\n" +
                "Балаклея (Харьковская обл)\n" +
                "Белозёрка (Херсонская обл)\n" +
                "Бобринец\n" +
                "Боярка\n" +
                "Балаклея (Черкасская обл)\n" +
                "Белозёрское (Донецкая обл)\n" +
                "Бобрка\n" +
                "Браилов\n" +
                "Балки (Запорожская обл)\n" +
                "Белозорье\n" +
                "Бобровица\n" +
                "Братское\n" +
                "Балта\n" +
                "Белокуракино\n" +
                "Богдан\n" +
                "Брацлав\n" +
                "Банилов\n" +
                "Белолуцк\n" +
                "Богдановка (Днепропетровская обл)\n" +
                "Брилевка\n" +
                "Бар\n" +
                "Белополье\n" +
                "Богдановка (Кировоградская обл)\n" +
                "Бровары\n" +
                "Баранинцы\n" +
                "Беляевка\n" +
                "Богодухов\n" +
                "Бродецкое\n" +
                "Барановка\n" +
                "Бердичев\n" +
                "Богородчаны\n" +
                "Броды\n" +
                "Барвенково\n" +
                "Бердянск\n" +
                "Богуслав (Днепропетровская обл)\n" +
                "Бронница\n" +
                "Барышевка\n" +
                "Берегово\n" +
                "Богуслав (Киевская обл)\n" +
                "Брошнев-Осада\n" +
                "Батурин\n" +
                "Берегомет\n" +
                "Божедаровка (Щорск)\n" +
                "Брусилов\n" +
                "Бахмач\n" +
                "Бережаны (Тернопольская обл)\n" +
                "Болград\n" +
                "Брюховичи\n" +
                "Бахмут (Артемовск)\n" +
                "Березанка (Николаевская обл)\n" +
                "Болехов\n" +
                "Буды\n" +
                "Баштанка\n" +
                "Березань\n" +
                "Большая Александровка\n" +
                "Бузаки\n" +
                "Бездрик\n" +
                "Березна\n" +
                "Большовцы\n" +
                "Буки\n" +
                "Безлюдовка\n" +
                "Березнеговатое\n" +
                "Борзна\n" +
                "Бурштын\n" +
                "Белая\n" +
                "Березное\n" +
                "Борислав\n" +
                "Бурынь\n" +
                "Белая Криница (Ровненская обл)\n" +
                "Березовка\n" +
                "Борисполь\n" +
                "Буск\n" +
                "Белая Церковь\n" +
                "Берестечко\n" +
                "Боровая (Киевская обл)\n" +
                "Буча\n" +
                "Белгород-Днестровский\n" +
                "Берислав\n" +
                "Боровая (Харьковская обл)\n" +
                "Бучач\n" +
                "Беленькое (Запорожская обл)\n" +
                "Бершадь\n" +
                "Боровское (Луганская обл)\n" +
                "Буштыно\n" +
                "Белики\n" +
                "Бильмак (Куйбышево)\n" +
                "Бородянка\n" +
                "Былбасовка\n" +
                "Белицкое\n" +
                "Благовещенка\n" +
                "Боромля\n" +
                "Бышев\n" +
                "Белки (Закарпатская обл)\n" +
                "В\n" +
                "Валки\n" +
                "Великие Комяты\n" +
                "Веселиново\n" +
                "Воловец\n" +
                "Вапнярка\n" +
                "Великие Копани\n" +
                "Весёлое (Запорожская обл)\n" +
                "Володарка\n" +
                "Вараш (Кузнецовск)\n" +
                "Великие Крынки\n" +
                "Вижница\n" +
                "Волочиск\n" +
                "Варва\n" +
                "Великие Лазы\n" +
                "Вийтовка\n" +
                "Волчанск\n" +
                "Васильевка (Запорожская обл)\n" +
                "Великие Лучки\n" +
                "Вилково\n" +
                "Волчинец (Ивано-Франковская обл)\n" +
                "Васильевка (Одесская обл)\n" +
                "Великие Мосты\n" +
                "Вилок\n" +
                "Вольногорск\n" +
                "Васильков\n" +
                "Великие Сорочинцы\n" +
                "Винники\n" +
                "Вольное (Днепропетровская обл)\n" +
                "Васильковка\n" +
                "Великий Березный\n" +
                "Винница\n" +
                "Вольнянск\n" +
                "Васьковичи\n" +
                "Великий Бурлук\n" +
                "Винницкие Хутора\n" +
                "Ворзель\n" +
                "Ватутино\n" +
                "Великий Бычков\n" +
                "Виноградов\n" +
                "Ворожба\n" +
                "Вашковцы\n" +
                "Великий Дальник\n" +
                "Виньковцы\n" +
                "Воронеж\n" +
                "Великая Александровка\n" +
                "Великий Кучуров\n" +
                "Виры (Ровненская обл)\n" +
                "Вороновица (Винницкая обл)\n" +
                "Великая Багачка\n" +
                "Великий Любень\n" +
                "Вита-Почтовая\n" +
                "Вороньков\n" +
                "Великая Березовица\n" +
                "Великодолинское\n" +
                "Вишенки (Киевская обл)\n" +
                "Ворохта\n" +
                "Великая Виска\n" +
                "Велятино\n" +
                "Вишневец\n" +
                "Воскресенское (Николаевская обл)\n" +
                "Великая Дымерка\n" +
                "Вендичаны\n" +
                "Вишнёвое\n" +
                "Врадиевка\n" +
                "Великая Знаменка\n" +
                "Верба (Ровненская обл)\n" +
                "Владимир-Волынский\n" +
                "Выгода (Ивано-Франковская обл)\n" +
                "Великая Лепетиха\n" +
                "Вербка (Волынская обл)\n" +
                "Владимирец\n" +
                "Выжница\n" +
                "Великая Михайловка\n" +
                "Верхнеднепровск\n" +
                "Владимировка\n" +
                "Выпасное\n" +
                "Великая Новоселка\n" +
                "Верхнее Водяное\n" +
                "Власовка\n" +
                "Выришальное\n" +
                "Великая Писаревка\n" +
                "Верхнее Синевидное\n" +
                "Водяное (Запорожская обл)\n" +
                "Высокий\n" +
                "Великая Фосня\n" +
                "Верхний Рогачик\n" +
                "Вознесенка (Запорожская обл)\n" +
                "Высокополье\n" +
                "Великая Чернетчина\n" +
                "Верхняя Сыроватка\n" +
                "Вознесенск\n" +
                "Вышгород\n" +
                "Великие Борки\n" +
                "Верховина\n" +
                "Войтовцы (Хмельницкая обл)\n" +
                "Вышково\n" +
                "Великие Гаи\n" +
                "Верховцево\n" +
                "Волноваха\n" +
                "Вязовка\n" +
                "Г\n" +
                "Гавришовка (Винницкая обл)\n" +
                "Глубокая\n" +
                "Гореничи\n" +
                "Гостинцово\n" +
                "Гадяч\n" +
                "Глухов\n" +
                "Горинчово\n" +
                "Гостомель\n" +
                "Гаевичи\n" +
                "Глуховцы\n" +
                "Горишние Плавни (Комсомольск)\n" +
                "Гошев\n" +
                "Гайворон\n" +
                "Глыбокая\n" +
                "Горловка\n" +
                "Гоща\n" +
                "Гайсин\n" +
                "Гнедин\n" +
                "Горностаевка\n" +
                "Градижск\n" +
                "Галич\n" +
                "Гнездычев\n" +
                "Горняк\n" +
                "Гребенка\n" +
                "Гатное\n" +
                "Гнивань\n" +
                "Городенка\n" +
                "Гребенки\n" +
                "Гвардейское (Днепропетровская обл)\n" +
                "Гоголев\n" +
                "Городец (Ровненская обл)\n" +
                "Григоровка (Киевская обл)\n" +
                "Гвоздев (Ровненская обл)\n" +
                "Гоголево\n" +
                "Городище\n" +
                "Гримайлов\n" +
                "Гвоздец\n" +
                "Голая Пристань\n" +
                "Городковка (Винницкая обл)\n" +
                "Грицев\n" +
                "Гельмязов\n" +
                "Голобы\n" +
                "Городня\n" +
                "Гришковцы\n" +
                "Геническ\n" +
                "Голованевск\n" +
                "Городок (Львовская обл)\n" +
                "Грушевка\n" +
                "Геронимовка\n" +
                "Головно\n" +
                "Городок (Хмельницкая обл)\n" +
                "Губиниха\n" +
                "Герца\n" +
                "Голубовка (Днепропетровская обл)\n" +
                "Горохов\n" +
                "Гуляйполе\n" +
                "Глеваха\n" +
                "Гончаровское\n" +
                "Горское\n" +
                "Гуничи\n" +
                "Глобино\n" +
                "Гора\n" +
                "Горького\n" +
                "Гусятин\n" +
                "Д\n" +
                "Давыдов\n" +
                "Джулинка\n" +
                "Довбыш\n" +
                "Дружба (Тернопольская обл)\n" +
                "Дарьевка (Херсонская обл)\n" +
                "Джурин (Винницкая обл)\n" +
                "Долгое (Закарпатская обл)\n" +
                "Дружковка\n" +
                "Дачное (Одесская обл)\n" +
                "Диканька\n" +
                "Долина\n" +
                "Дубляны\n" +
                "Дашев\n" +
                "Дмитровка (Кировоградская обл)\n" +
                "Долинская\n" +
                "Дубно\n" +
                "Двуречная\n" +
                "Дмитровка (Черниговская обл)\n" +
                "Долинское (Запорожская обл)\n" +
                "Дубовое (Закарпатская обл)\n" +
                "Дебальцево\n" +
                "Днепр (Днепропетровск)\n" +
                "Доманевка\n" +
                "Дубовый Гай\n" +
                "Дедковичи\n" +
                "Днепровка (Запорожская обл)\n" +
                "Донец (Червоный Донец)\n" +
                "Дубовязовка\n" +
                "Деловое\n" +
                "Днепровское (Днепропетровская обл)\n" +
                "Донецк\n" +
                "Дубровица\n" +
                "Делятин\n" +
                "Днепрорудное\n" +
                "Донское (Донецкая обл)\n" +
                "Дударков\n" +
                "Демидов\n" +
                "Добровеличковка\n" +
                "Дорошовка\n" +
                "Дулибы\n" +
                "Демидовка (Ровненская обл)\n" +
                "Добромиль\n" +
                "Драбов\n" +
                "Дунаевцы\n" +
                "Деражня\n" +
                "Доброполье\n" +
                "Драгово\n" +
                "Дунаевцы (Дунаевецкий р-н)\n" +
                "Дергачи\n" +
                "Добросин\n" +
                "Драчинцы\n" +
                "Дымер\n" +
                "Десна (Винницкая обл)\n" +
                "Доброслав\n" +
                "Дрогобыч\n" +
                "Дядьковичи\n" +
                "Десна (Черниговская обл)\n" +
                "Добротвор\n" +
                "Дружба (Сумская обл)\n" +
                "Е\n" +
                "Евпатория\n" +
                "Елизаветовка\n" +
                "Енакиево\n" +
                "Ерки\n" +
                "Еланец\n" +
                "Емильчино\n" +
                "Ж\n" +
                "Жашков\n" +
                "Жеребково\n" +
                "Житомир\n" +
                "Жолква\n" +
                "Железный Порт\n" +
                "Жидачев\n" +
                "Жмеринка\n" +
                "Журавно\n" +
                "Желтые Воды\n" +
                "З\n" +
                "Заболотов\n" +
                "Зарванцы\n" +
                "Збараж\n" +
                "Змиевка\n" +
                "Заболотье\n" +
                "Заречное (Димитрово)\n" +
                "Зборов\n" +
                "Знаменка (Кировоградская обл)\n" +
                "Заборье\n" +
                "Заречное (Ровненская обл)\n" +
                "Звенигородка\n" +
                "Знаменка (Одесская обл)\n" +
                "Завалье\n" +
                "Заречье\n" +
                "Згуровка\n" +
                "Знаменка Вторая\n" +
                "Заводское (Тернопольская обл)\n" +
                "Заря (Ровненская обл)\n" +
                "Здолбунов\n" +
                "Знаменовка\n" +
                "Заводское (Червонозаводское)\n" +
                "Заставна\n" +
                "Зеленогорское\n" +
                "Знобь-Новгородское\n" +
                "Зазимье\n" +
                "Засулье\n" +
                "Зеленодольск\n" +
                "Зняцево\n" +
                "Закусилы\n" +
                "Затишье\n" +
                "Зеньков\n" +
                "Золотоноша\n" +
                "Залещики\n" +
                "Затока\n" +
                "Зиньков\n" +
                "Золочев (Львовская обл)\n" +
                "Заложцы\n" +
                "Захаровка (Фрунзовка)\n" +
                "Змеинец\n" +
                "Золочев (Харьковская обл)\n" +
                "Запорожье\n" +
                "Зачепиловка (Харьковская обл)\n" +
                "Змиев\n" +
                "Зымна Вода\n" +
                "Запытов\n" +
                "И\n" +
                "Иваничи\n" +
                "Ивановка (Херсонская обл)\n" +
                "Иличанка\n" +
                "Ирпень\n" +
                "Иванков (Бориспольский район)\n" +
                "Игнатполь\n" +
                "Илларионово\n" +
                "Иршава\n" +
                "Иванков (Иванковский район)\n" +
                "Иза\n" +
                "Ильинцы\n" +
                "Иршанск\n" +
                "Ивано-Франково\n" +
                "Измаил\n" +
                "Ильница\n" +
                "Испас\n" +
                "Ивано-Франковск\n" +
                "Изюм\n" +
                "Ирклиев\n" +
                "Ичня\n" +
                "Ивановка (Одесская обл)\n" +
                "Изяслав\n" +
                "К\n" +
                "Кагарлык\n" +
                "Киверцы\n" +
                "Компанеевка\n" +
                "Красная Поляна\n" +
                "Казанка\n" +
                "Киев\n" +
                "Конецполь\n" +
                "Красноград\n" +
                "Казатин\n" +
                "Килия\n" +
                "Конотоп\n" +
                "Красное (Львовская обл)\n" +
                "Казачья Лопань\n" +
                "Кириковка\n" +
                "Константиновка (Донецкая обл)\n" +
                "Краснокутск\n" +
                "Каланчак\n" +
                "Кирилловка\n" +
                "Константиновка (Запорожская обл)\n" +
                "Краснопавловка\n" +
                "Калиновка (Винницкая обл)\n" +
                "Кислица\n" +
                "Константиновка (Николаевская обл)\n" +
                "Краснополье\n" +
                "Калиновка (Киевская обл)\n" +
                "Кицмань\n" +
                "Копайгород\n" +
                "Краснореченское\n" +
                "Калита\n" +
                "Клавдиево-Тарасово\n" +
                "Копашново\n" +
                "Кременец\n" +
                "Калуш\n" +
                "Клевань\n" +
                "Копылов\n" +
                "Кременная\n" +
                "Каменец-Подольский\n" +
                "Клесов\n" +
                "Копыстин\n" +
                "Кременчуг\n" +
                "Каменка (Черкасская обл)\n" +
                "Клишковцы\n" +
                "Копычинцы\n" +
                "Кривое Озеро\n" +
                "Каменка (Черновицкая обл)\n" +
                "Клугино-Башкировка\n" +
                "Корец\n" +
                "Кривой Рог\n" +
                "Каменка-Бугская\n" +
                "Княжичи\n" +
                "Корнын\n" +
                "Кринички\n" +
                "Каменка-Днепровская\n" +
                "Кобеляки\n" +
                "Королево\n" +
                "Криховцы\n" +
                "Каменское (Днепродзержинск)\n" +
                "Коблево\n" +
                "Короп\n" +
                "Кролевец\n" +
                "Камень-Каширский\n" +
                "Ковель\n" +
                "Коростень\n" +
                "Кропивницкий (Кировоград)\n" +
                "Камышаны\n" +
                "Ковшаровка\n" +
                "Коростышев\n" +
                "Крупец\n" +
                "Камышеваха\n" +
                "Кодыма\n" +
                "Корсунь-Шевченковский\n" +
                "Крыжановка\n" +
                "Камышня\n" +
                "Козацкое (Херсонская обл)\n" +
                "Коршев\n" +
                "Крыжополь\n" +
                "Канев\n" +
                "Козелец\n" +
                "Корытняны\n" +
                "Крымное\n" +
                "Карапыши\n" +
                "Козельщина\n" +
                "Корюковка\n" +
                "Крюковщина\n" +
                "Карловка\n" +
                "Козин\n" +
                "Косов\n" +
                "Ксаверовка\n" +
                "Карнауховка\n" +
                "Козова\n" +
                "Косовщина\n" +
                "Куликов\n" +
                "Каролино-Бугаз\n" +
                "Козын\n" +
                "Косонь\n" +
                "Куликовка\n" +
                "Карповка\n" +
                "Колки\n" +
                "Костополь\n" +
                "Купянск\n" +
                "Катеринополь\n" +
                "Колоденка\n" +
                "Котельва\n" +
                "Купянск-Узловой\n" +
                "Каховка\n" +
                "Коломак\n" +
                "Коцюбинское\n" +
                "Курахово\n" +
                "Квасилов\n" +
                "Коломыя\n" +
                "Краковец\n" +
                "Куты (Ивано-Франковская обл)\n" +
                "Кегичевка\n" +
                "Колочава\n" +
                "Краматорск\n" +
                "Кучурган\n" +
                "Кельменцы\n" +
                "Комар\n" +
                "Красилов\n" +
                "Кушница\n" +
                "Керецки\n" +
                "Комарно\n" +
                "Красиловка\n" +
                "Л\n" +
                "Ладан\n" +
                "Летичев\n" +
                "Лозовая\n" +
                "Лысая Гора\n" +
                "Ладыжин\n" +
                "Лешня\n" +
                "Локачи\n" +
                "Лысянка\n" +
                "Ладыжинка\n" +
                "Лиман (Красный Лиман)\n" +
                "Лопатин\n" +
                "Львов\n" +
                "Лазорки\n" +
                "Лиманское\n" +
                "Лосиновка\n" +
                "Любар\n" +
                "Лазурное\n" +
                "Липины (Волынская обл)\n" +
                "Лохвица\n" +
                "Любашевка\n" +
                "Лановцы\n" +
                "Липовая Долина\n" +
                "Лубны\n" +
                "Любешов\n" +
                "Ланчин\n" +
                "Липовец\n" +
                "Луганск\n" +
                "Любимовка\n" +
                "Ласки\n" +
                "Лисичанск\n" +
                "Лугины\n" +
                "Люблинец\n" +
                "Лебедин (Сумская обл)\n" +
                "Литин\n" +
                "Лужаны\n" +
                "Любомль\n" +
                "Лебедин (Черкасская обл)\n" +
                "Лобачи\n" +
                "Лука-Мелешковская\n" +
                "Люботин\n" +
                "Левковичи\n" +
                "Лозно-Александровка\n" +
                "Луков\n" +
                "Лютеж\n" +
                "Лесовщина\n" +
                "Лозоватка\n" +
                "Луцк\n" +
                "М\n" +
                "Магдалиновка\n" +
                "Марганец\n" +
                "Мена\n" +
                "Млинов\n" +
                "Майское\n" +
                "Мариуполь\n" +
                "Мерефа\n" +
                "Могилев\n" +
                "Макаров\n" +
                "Марковка\n" +
                "Мешково-Погорелово\n" +
                "Могилев-Подольский\n" +
                "Макеевка\n" +
                "Марьинка\n" +
                "Мигово\n" +
                "Можары\n" +
                "Малая Белозерка\n" +
                "Марьянское\n" +
                "Мизоч\n" +
                "Молодежное\n" +
                "Малая Виска\n" +
                "Матвеевка\n" +
                "Микулинцы (Тернопольская обл)\n" +
                "Молочанск\n" +
                "Малая Даниловка\n" +
                "Махновка (Винницкая обл)\n" +
                "Мила\n" +
                "Монастыриска\n" +
                "Малая Перещепина\n" +
                "Машевка\n" +
                "Минай\n" +
                "Монастырище\n" +
                "Малая Фосня\n" +
                "Медвежье Ушко\n" +
                "Миргород\n" +
                "Моршин\n" +
                "Малехов\n" +
                "Меденичи\n" +
                "Мирноград (Димитров)\n" +
                "Москва\n" +
                "Малин\n" +
                "Меджибож\n" +
                "Мирное\n" +
                "Мостиска\n" +
                "Малиновка (Харьковская обл)\n" +
                "Межгорье\n" +
                "Мироновка\n" +
                "Мостки (Луганская обл)\n" +
                "Мамаевцы\n" +
                "Межевая\n" +
                "Мирополь (Житомирская область)\n" +
                "Мошны\n" +
                "Мамалига\n" +
                "Мелиоративное\n" +
                "Мирополье (Сумская область)\n" +
                "Мукачево\n" +
                "Мангуш\n" +
                "Мелитополь\n" +
                "Михайловка (Запорожская обл)\n" +
                "Мурафа\n" +
                "Маневичи\n" +
                "Меловое\n" +
                "Михайловка (Черкасская обл)\n" +
                "Мурованое\n" +
                "Маньковка\n" +
                "Мельница-Подольская\n" +
                "Михайловка-Рубежовка\n" +
                "Мурованые Куриловцы\n" +
                "Н\n" +
                "Надворная\n" +
                "Нижняя Дуванка\n" +
                "Новгород-Северский\n" +
                "Новониколаевка (Запорожская обл)\n" +
                "Народичи\n" +
                "Нижняя Сыроватка\n" +
                "Новгородка\n" +
                "Новониколаевка (Хенсонская обл)\n" +
                "Недобоевцы\n" +
                "Низы\n" +
                "Новгородское\n" +
                "Новопавловка\n" +
                "Недригайлов\n" +
                "Николаев\n" +
                "Новоайдар\n" +
                "Новопокровка (Харьковская обл)\n" +
                "Нежин\n" +
                "Николаев (Львовская обл)\n" +
                "Новоалександровка (Днепропетровская обл)\n" +
                "Новопсков\n" +
                "Некрасово\n" +
                "Николаевка (Днепропетровская обл)\n" +
                "Новоалександровка (Херсонская обл)\n" +
                "Новоселица\n" +
                "Немешаево\n" +
                "Николаевка (Донецкая обл)\n" +
                "Новоалексеевка\n" +
                "Новосёлки\n" +
                "Немиров (Винницкая обл)\n" +
                "Николаевка (Одесская обл)\n" +
                "Новоархангельск\n" +
                "Новотроицкое (Донецкая обл)\n" +
                "Немиров (Львовская обл)\n" +
                "Николаевка (Сумская обл)\n" +
                "Новобогдановка\n" +
                "Новотроицкое (Херсонская обл)\n" +
                "Неполоковцы\n" +
                "Никольское\n" +
                "Нововолынск\n" +
                "Новоукраинка\n" +
                "Нересница\n" +
                "Никополь\n" +
                "Нововоронцовка\n" +
                "Новояворовск\n" +
                "Нерубайское\n" +
                "Нисмичи\n" +
                "Новоград-Волынский\n" +
                "Новые Белокоровичи\n" +
                "Нетешин\n" +
                "Новая Боровая\n" +
                "Новогродовка\n" +
                "Новые Петровцы\n" +
                "Нехвороща\n" +
                "Новая Водолага\n" +
                "Новогуйвинское\n" +
                "Новые Санжары\n" +
                "Нещеретово\n" +
                "Новая Галещина\n" +
                "Новоднестровск\n" +
                "Новый Буг\n" +
                "Нива Трудовая\n" +
                "Новая Збурьевка\n" +
                "Новодружеск\n" +
                "Новый Калинов\n" +
                "Нижанковичи\n" +
                "Новая Каховка\n" +
                "Новое\n" +
                "Новый Роздол\n" +
                "Нижнее Селище\n" +
                "Новая Маячка\n" +
                "Новомиргород\n" +
                "Новый Стародуб\n" +
                "Нижние Ворота\n" +
                "Новая Одесса\n" +
                "Новомосковск\n" +
                "Новый Ярычев\n" +
                "Нижние Серогозы\n" +
                "Новая Прага\n" +
                "Новониколаевка (Днепропетровская обл)\n" +
                "Носовка\n" +
                "Нижние Становцы\n" +
                "Новая Ушица\n" +
                "О\n" +
                "Обертин\n" +
                "Озерное (Житомирская обл)\n" +
                "Ольшаны (Харьковская обл)\n" +
                "Орловщина\n" +
                "Оболонь\n" +
                "Окны (Красные Окны)\n" +
                "Оноковцы\n" +
                "Осипенко (Запорожская обл)\n" +
                "Обухов\n" +
                "Олевск\n" +
                "Онуфриевка\n" +
                "Остер\n" +
                "Обуховка (Кировское)\n" +
                "Олыка\n" +
                "Опошня\n" +
                "Остров\n" +
                "Овидиополь\n" +
                "Ольгополь (Винницкая обл)\n" +
                "Опытное (Донецкая обл)\n" +
                "Острог\n" +
                "Овруч\n" +
                "Ольховцы\n" +
                "Оратов\n" +
                "Острожец\n" +
                "Одесса\n" +
                "Ольшана (Сумская обл)\n" +
                "Орехов\n" +
                "Отыния\n" +
                "Оженин\n" +
                "Ольшанка (Кировоградская обл)\n" +
                "Оржев\n" +
                "Очаков\n" +
                "Озерная\n" +
                "Ольшанское\n" +
                "Оржица\n" +
                "Очеретино\n" +
                "П\n" +
                "Павлов\n" +
                "Песковка (Киевская обл)\n" +
                "Погребы\n" +
                "Понинка\n" +
                "Павлоград\n" +
                "Песочин\n" +
                "Подбуж\n" +
                "Понорница\n" +
                "Павлыш\n" +
                "Песчаница\n" +
                "Подволочиск\n" +
                "Попасная\n" +
                "Пантаевка\n" +
                "Песчанка (Винницкая обл)\n" +
                "Подгайцы (Волынская обл)\n" +
                "Попельня\n" +
                "Панютино\n" +
                "Песчанка (Днепропетровская обл)\n" +
                "Подгайцы (Тернопольская обл)\n" +
                "Потаповичи\n" +
                "Парафиевка\n" +
                "Песчаное (Полтавская обл)\n" +
                "Подгоровка\n" +
                "Почаев\n" +
                "Партизанское\n" +
                "Песчаное (Черкасская обл)\n" +
                "Подгородное\n" +
                "Почапинцы\n" +
                "Первомайск (Николаевская обл)\n" +
                "Песчаный Брод\n" +
                "Подольск (Котовск)\n" +
                "Преображенка (Херсонская обл)\n" +
                "Первомайский\n" +
                "Петриковка\n" +
                "Подрудье\n" +
                "Приазовское\n" +
                "Первомайское\n" +
                "Петрово\n" +
                "Покотиловка\n" +
                "Прилуки\n" +
                "Перегинское\n" +
                "Петровское (Харьковская обл)\n" +
                "Покров (Орджоникидзе)\n" +
                "Приморск\n" +
                "Перегоновка\n" +
                "Петропавловка\n" +
                "Покровск (Красноармейск)\n" +
                "Приютовка\n" +
                "Перемышляны\n" +
                "Петропавловская Борщаговка\n" +
                "Покровское (Днепропетровская обл)\n" +
                "Пролиски\n" +
                "Пересадовка\n" +
                "Печенеги\n" +
                "Покровское (Донецкая обл)\n" +
                "Просяная\n" +
                "Перечин\n" +
                "Печенежин\n" +
                "Полигон\n" +
                "Пулины (Червоноармейск)\n" +
                "Перещепино\n" +
                "Пивденное\n" +
                "Пологи\n" +
                "Пустомыты\n" +
                "Переяслав-Хмельницкий\n" +
                "Пивничное (Донецкая обл)\n" +
                "Полонное\n" +
                "Путивль\n" +
                "Першотравенск (Днепропетровская обл)\n" +
                "Пирятин\n" +
                "Полтава\n" +
                "Путила\n" +
                "Першотравенск (Житомирская обл)\n" +
                "Плотыча\n" +
                "Поляна\n" +
                "Пядики\n" +
                "Першотравневое\n" +
                "Побугское\n" +
                "Поляница\n" +
                "Пятихатки\n" +
                "Пески-Радьковские\n" +
                "Погребище\n" +
                "Помошная\n" +
                "Р\n" +
                "Рава-Русская\n" +
                "Ратно\n" +
                "Рогатин\n" +
                "Ромодан\n" +
                "Радехов\n" +
                "Рафаловка\n" +
                "Родинское\n" +
                "Ростов-на-Дону\n" +
                "Радивилов\n" +
                "Рахны-Лесовые\n" +
                "Рожище\n" +
                "Рубановка (Херсонская обл)\n" +
                "Радомышль\n" +
                "Рахов\n" +
                "Рожнятов\n" +
                "Рубежное\n" +
                "Радушное\n" +
                "Ременов\n" +
                "Роздоры\n" +
                "Рудки\n" +
                "Раздельная\n" +
                "Рени\n" +
                "Розовка (Запорожская обл)\n" +
                "Рудно\n" +
                "Райгородка\n" +
                "Репки\n" +
                "Розтоки\n" +
                "Рудное\n" +
                "Райгородок\n" +
                "Решетиловка\n" +
                "Рокитное\n" +
                "Ружин\n" +
                "Райское\n" +
                "Ржищев\n" +
                "Рокосово\n" +
                "Русская Лозовая\n" +
                "Ракитное (Киевская обл)\n" +
                "Ровно\n" +
                "Романковцы\n" +
                "Русская Поляна\n" +
                "Ракошино\n" +
                "Ровное (Кировокрадская обл)\n" +
                "Романов\n" +
                "Рыково\n" +
                "Ралевка\n" +
                "Рогань\n" +
                "Ромны\n" +
                "Рясное-Русское\n" +
                "Рассошенцы\n" +
                "С\n" +
                "Саврань\n" +
                "Сингуры\n" +
                "Соленое\n" +
                "Стеблев\n" +
                "Сагуновка\n" +
                "Синевир\n" +
                "Солоницевка\n" +
                "Стеблёвка\n" +
                "Сад\n" +
                "Синельниково\n" +
                "Солонка\n" +
                "Стебник\n" +
                "Самбор\n" +
                "Ситковцы\n" +
                "Солотвин\n" +
                "Степановка (Сумская обл)\n" +
                "Сарата\n" +
                "Скадовск\n" +
                "Солотвино\n" +
                "Степань\n" +
                "Сарны\n" +
                "Скала-Подольская\n" +
                "Сосница\n" +
                "Стецковка\n" +
                "Сартана\n" +
                "Скалат\n" +
                "Сосновка\n" +
                "Сторожинец\n" +
                "Сатанов\n" +
                "Сквира\n" +
                "Софиевка\n" +
                "Сторожница\n" +
                "Сахновщина\n" +
                "Сколе\n" +
                "Софиевская Борщаговка\n" +
                "Стоянка\n" +
                "Свалява\n" +
                "Скороходово\n" +
                "Сошично\n" +
                "Стоянов\n" +
                "Сватово\n" +
                "Славское\n" +
                "Сребное (Черниговская обл)\n" +
                "Страбичово\n" +
                "Свесса\n" +
                "Славута\n" +
                "Среднее\n" +
                "Стрелки\n" +
                "Светловодск\n" +
                "Славутич\n" +
                "Среднее Водяное\n" +
                "Стрелковичи\n" +
                "Светлодарск\n" +
                "Славянск\n" +
                "Ставище\n" +
                "Стрельбичи\n" +
                "Святогорск\n" +
                "Слатино\n" +
                "Станица Луганская\n" +
                "Стрижавка\n" +
                "Святопетровское\n" +
                "Слобожанское (Комсомольское)\n" +
                "Старая Выжевка\n" +
                "Струмовка\n" +
                "Севастополь\n" +
                "Словечно\n" +
                "Старая Синява\n" +
                "Стрый\n" +
                "Северодонецк\n" +
                "Смела\n" +
                "Старая Ушица\n" +
                "Стуфчинцы\n" +
                "Северск\n" +
                "Смига\n" +
                "Старобельск\n" +
                "Субботцы\n" +
                "Селец\n" +
                "Смолино\n" +
                "Старовойтово\n" +
                "Суворово\n" +
                "Селидово\n" +
                "Снежное\n" +
                "Староказачье\n" +
                "Судилков\n" +
                "Семеновка (Полтавская обл)\n" +
                "Снигиревка\n" +
                "Староконстантинов\n" +
                "Судовая Вишня\n" +
                "Семёновка (Черниговская обл)\n" +
                "Сновск (Щорс)\n" +
                "Старомлыновка\n" +
                "Сумы\n" +
                "Сенча\n" +
                "Снятын\n" +
                "Старый Крым\n" +
                "Супруновка\n" +
                "Сергеевка\n" +
                "Сокаль\n" +
                "Старый Острополь\n" +
                "Сурско-Литовское\n" +
                "Серебрия\n" +
                "Сокирница\n" +
                "Старый Самбор\n" +
                "Сутиски\n" +
                "Середина-Буда\n" +
                "Сокиряны\n" +
                "Стаси\n" +
                "Сходница\n" +
                "Сивашское\n" +
                "Соколовка\n" +
                "Стаханов\n" +
                "Счастливое\n" +
                "Сигнаевка\n" +
                "Сокольники (Львовская обл)\n" +
                "Сташки\n" +
                "Счастье\n" +
                "Симферополь\n" +
                "Соледар\n" +
                "Т\n" +
                "Таврийск\n" +
                "Теофиполь\n" +
                "Тлумач\n" +
                "Троицкое (Одесская обл)\n" +
                "Таврийское (Кирово)\n" +
                "Теплик\n" +
                "Токаревка (Кудрявцевка)\n" +
                "Тростянец (Винницкая обл)\n" +
                "Таирово\n" +
                "Теплодар\n" +
                "Токмак\n" +
                "Тростянец (Сумская обл)\n" +
                "Талаковка\n" +
                "Теребовля\n" +
                "Толстое\n" +
                "Трускавец\n" +
                "Талалаевка\n" +
                "Тересва\n" +
                "Томаковка\n" +
                "Тульчин\n" +
                "Тальное\n" +
                "Терешки\n" +
                "Томашгород\n" +
                "Турбов\n" +
                "Тальянки\n" +
                "Терновка\n" +
                "Томашполь\n" +
                "Турийск\n" +
                "Тарановка\n" +
                "Тернополь\n" +
                "Топорище\n" +
                "Турка\n" +
                "Тарасовка\n" +
                "Терны\n" +
                "Торецк (Дзержинск)\n" +
                "Тучин\n" +
                "Тарасовцы\n" +
                "Терпенье\n" +
                "Торчин\n" +
                "Тывров\n" +
                "Тараща\n" +
                "Тетиев\n" +
                "Требухов\n" +
                "Тысменица\n" +
                "Тарутино\n" +
                "Тинное\n" +
                "Триполье\n" +
                "Тячев\n" +
                "Татарбунары\n" +
                "Тишковка\n" +
                "Троицкое (Луганская обл)\n" +
                "У\n" +
                "Угледар\n" +
                "Узин\n" +
                "Уланов\n" +
                "Усатово\n" +
                "Угля\n" +
                "Узловое\n" +
                "Умань\n" +
                "Устилуг\n" +
                "Угринов\n" +
                "Украинка\n" +
                "Урзуф\n" +
                "Устиновка\n" +
                "Ужгород\n" +
                "Украинск\n" +
                "Ф\n" +
                "Фастов\n" +
                "Феодосия\n" +
                "Фонтанка\n" +
                "Х\n" +
                "Харьков\n" +
                "Ходоров\n" +
                "Хорошев (Володарск-Волынский)\n" +
                "Хотяновка\n" +
                "Херсон\n" +
                "Холодная Балка\n" +
                "Хотень\n" +
                "Христиновка\n" +
                "Хмелевое\n" +
                "Хорол\n" +
                "Хотин\n" +
                "Хуст\n" +
                "Хмельник\n" +
                "Хоростков\n" +
                "Хотов\n" +
                "Хыров\n" +
                "Хмельницкий\n" +
                "Ц\n" +
                "Царичанка\n" +
                "Цибулев\n" +
                "Циркуны\n" +
                "Цумань\n" +
                "Цекиновка\n" +
                "Ч\n" +
                "Чабаны\n" +
                "Черкасское\n" +
                "Черноморское\n" +
                "Чоп\n" +
                "Чайки\n" +
                "Черкассы\n" +
                "Чернухи\n" +
                "Чорнобаевка\n" +
                "Чаплинка\n" +
                "Черневцы\n" +
                "Чернятин\n" +
                "Чорный Остров\n" +
                "Чаплино\n" +
                "Чернигов\n" +
                "Черняхов\n" +
                "Чортков\n" +
                "Часов Яр\n" +
                "Черниговка\n" +
                "Чечельник\n" +
                "Чугуев\n" +
                "Чемеровцы\n" +
                "Черниев\n" +
                "Чигирин\n" +
                "Чудей\n" +
                "Червоная Каменка\n" +
                "Чернобаевка (Херсонская обл)\n" +
                "Чинадиево\n" +
                "Чуднов\n" +
                "Червоная Слобода (Черкасская обл)\n" +
                "Чернобай\n" +
                "Чкалово\n" +
                "Чулаковка\n" +
                "Червоноград\n" +
                "Черновцы\n" +
                "Чкаловское\n" +
                "Чупаховка\n" +
                "Червоное (Житомирская обл)\n" +
                "Черноморск (Ильичевск)\n" +
                "Чонгар\n" +
                "Чутово\n" +
                "Ш\n" +
                "Шабо\n" +
                "Шаян\n" +
                "Шегини\n" +
                "Шкло\n" +
                "Шаргород\n" +
                "Шевченково (Николаевская обл)\n" +
                "Шепетовка\n" +
                "Шостка\n" +
                "Шаровечка\n" +
                "Шевченково (Одесская обл)\n" +
                "Шипинцы\n" +
                "Шпитьки\n" +
                "Шатава\n" +
                "Шевченково (Харьковская обл)\n" +
                "Широкое\n" +
                "Шпола\n" +
                "Шахтерск\n" +
                "Шевченково (Харьковская область)\n" +
                "Ширяево\n" +
                "Шумск\n" +
                "Шацк\n" +
                "Шевченково (Черкасская обл)\n" +
                "Шишаки\n" +
                "Щ\n" +
                "Щербани\n" +
                "Щирец\n" +
                "Э\n" +
                "Энергодар\n" +
                "Ю\n" +
                "Южное\n" +
                "Южноукраинск\n" +
                "Южный\n" +
                "Юрьевка\n" +
                "Я\n" +
                "Яблонов\n" +
                "Ялта\n" +
                "Яремче\n" +
                "Ясенов-Польный\n" +
                "Яворов\n" +
                "Ямполь (Винницкая обл)\n" +
                "Яреськи\n" +
                "Ясиноватая\n" +
                "Яготин\n" +
                "Ямполь (Сумская обл)\n" +
                "Ярмолинцы\n" +
                "Ясиня";

    }
}
